-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 18, 2023 at 05:25 PM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.0.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `debt`
--

-- --------------------------------------------------------

--
-- Table structure for table `account_debt`
--

CREATE TABLE `account_debt` (
  `id` int(11) NOT NULL,
  `debt_id` int(11) NOT NULL,
  `account_manager` varchar(50) NOT NULL,
  `loan_account_number` varchar(20) NOT NULL,
  `loan_account_type` varchar(100) NOT NULL,
  `loan_group` varchar(100) NOT NULL,
  `loan_account_status` varchar(50) NOT NULL,
  `status_change_date` varchar(50) NOT NULL,
  `request_deferral` varchar(50) NOT NULL,
  `request_suspend` varchar(50) NOT NULL,
  `date_suspend` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `account_debt`
--

INSERT INTO `account_debt` (`id`, `debt_id`, `account_manager`, `loan_account_number`, `loan_account_type`, `loan_group`, `loan_account_status`, `status_change_date`, `request_deferral`, `request_suspend`, `date_suspend`) VALUES
(1, 1, 'KTB', '1019025638', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(2, 2, 'KTB', '1035895986', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(3, 3, 'KTB', '1035592002', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(4, 4, 'KTB', '1023384779', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(5, 5, 'KTB', '1035665689', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(6, 6, 'KTB', '1035565919', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(7, 7, 'KTB', '1035565862', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(8, 8, 'KTB', '1035540851', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(9, 9, 'KTB', '1035712172', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(10, 10, 'KTB', '1035674696', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(11, 11, 'KTB', '1035774968', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(12, 12, 'KTB', '1028496419', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(13, 13, 'KTB', '1011193450', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '09/10/2552', '-', '-', '-'),
(14, 14, 'KTB', '1011330482', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '09/10/2552', '-', '-', '-'),
(15, 15, 'KTB', '1011348012', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '09/10/2552', '-', '-', '-'),
(16, 16, 'KTB', '1036852075', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(17, 17, 'KTB', '1037045890', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(18, 18, 'KTB', '1037077296', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(19, 19, 'KTB', '1012037614', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(20, 20, 'KTB', '1012039110', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(21, 21, 'KTB', '1012110311', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(22, 22, 'KTB', '1012425061', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(23, 23, 'KTB', '1012386155', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-'),
(24, 24, 'KTB', '1012808181', 'บัญชีเงินกู้กยศ.', 'กลุ่มบังคับคดี', 'ปกติ', '10/10/2552', '-', '-', '-');

-- --------------------------------------------------------

--
-- Table structure for table `debtor`
--

CREATE TABLE `debtor` (
  `id` int(11) NOT NULL,
  `idcard` varchar(13) NOT NULL,
  `prefix` varchar(20) NOT NULL,
  `fname` varchar(100) NOT NULL,
  `lname` varchar(100) NOT NULL,
  `no_account` varchar(20) NOT NULL,
  `status_account` varchar(50) NOT NULL,
  `status_personal` varchar(50) NOT NULL,
  `type_account` varchar(100) NOT NULL,
  `telephone` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `debtor`
--

INSERT INTO `debtor` (`id`, `idcard`, `prefix`, `fname`, `lname`, `no_account`, `status_account`, `status_personal`, `type_account`, `telephone`) VALUES
(1, '5411400064501', 'นาย', 'อภิชาติ', 'บุญกว้าง', '1019025638', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0621704094\",\"0611656218\"]'),
(2, '1420900133940', 'นางสาว', 'สุพัตรา', 'ทองจีน', '1035895986', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"064-4858295\"]'),
(3, '1101499060677', 'นางสาว', 'พัชรี', 'แก้วดวงดี', '1035592002', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0945367557\"]'),
(4, '2960100013846', 'นางสาว', 'ไซนอลี', 'สามะ', '1023384779', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0639628006\",\"0917517304\",\"0954692584\",\"0835179591\"]'),
(5, '1420900098770', 'นาย', 'วิทยา', 'พรมจำปา', '1035665689', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0985801123\"]'),
(6, '1429900096619', 'นางสาว', 'จิราภรณ์', 'ครุนันท์', '1035565919', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0621533689\"]'),
(7, '1421000131763', 'นางสาว', 'เพ็ญนภา', 'ผงสุข', '1035565862', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0801998583\",\"0917450487\"]'),
(8, '1430100092629', 'นางสาว', 'จิตรา', 'พานุรัตน์', '1035540851', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0642628088\",\"0841234318\",\"0886912498\",\"0638709125\"]'),
(9, '1429900092028', 'นาย', 'เบญจรงค์', 'ศรีอินทร์', '1035712172', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0656402901\",\"0806636049\"]'),
(10, '3420200083300', 'นาย', 'สมชาย', 'รามศิริ', '1035674696', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0944460740\"]'),
(11, '1420900170586', 'นางสาว', 'สุดารัตน์', 'สุขมา', '1035774968', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0981230530\"]'),
(12, '3410101392321', 'นางสาว', 'อรัญญา', 'ดอนเสือ', '1028496419', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0958032150\"]'),
(13, '3400101091720', 'นางสาว', 'กาญจนา', 'เพียดสิงห์', '1011193450', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0944100419\",\"0617482281\",\"0815788061\"]'),
(14, '3420600035086', 'นางสาว', 'กาญจนา', 'กมลรัตน์', '1011330482', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0655390053\",\"0935248394\",\"0931357834\",\"0845402710\"]'),
(15, '5420990035422', 'นางสาว', 'ปรียารัตน์', 'บางใบ', '1011348012', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0627841351\"]'),
(16, '3411200418230', 'นาย', 'บัณฑิต', 'กมุลคร', '1036852075', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0627980863\",\"0934871179\"]'),
(17, '3411400653658', 'นาย', 'บุญญฤทธิ์', 'คุยบุตร', '1037045890', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0982147241\",\"0857576763\",\"0938431514\"]'),
(18, '4411500004072', 'นาย', 'ศุภกร', 'วิแสง', '1037077296', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0872328119\"]'),
(19, '3420300274883', 'นาย', 'กมล', 'อาศัย', '1012037614', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0621230122\",\"0637294499\"]'),
(20, '3420500249971', 'นาง', 'ธนพร', 'สลีอ่อน', '1012039110', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0648368569\"]'),
(21, '3420100234527', 'นางสาว', 'วาสนา', 'วรพันธ์', '1012110311', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0951685193\"]'),
(22, '3420100485279', 'นางสาว', 'สุพัตรา', 'เภาแสน', '1012425061', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0637469568\",\"0967122187\",\"0826562476\"]'),
(23, '3420500214230', 'นาง', 'ประภัสสร', 'มาโฮนีย์', '1012386155', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0639980453\"]'),
(24, '5411400107285', 'นาง', 'เกศรินทร์', 'เนาว์โพธิ์ทอง', '1012808181', '00', 'ปกติ', 'บัญชีเงินกู้กยศ.', '[\"0850478238\"]');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `account_debt`
--
ALTER TABLE `account_debt`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `debtor`
--
ALTER TABLE `debtor`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `account_debt`
--
ALTER TABLE `account_debt`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT for table `debtor`
--
ALTER TABLE `debtor`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
